GopalSaraf/Practicals/PSDL/include/proc/pic16f1619.inc
// Register: AT1CSEL2
#define AT1CSEL2 AT1CSEL2
AT1CSEL2                                 equ 0892h
// bitfield definitions
AT1CSEL2_AT1CP2S_POSN                    equ 0000h
AT1CSEL2_AT1CP2S_POSITION                equ 0000h
AT1CSEL2_AT1CP2S_SIZE                    equ 0003h
AT1CSEL2_AT1CP2S_LENGTH                  equ 0003h
AT1CSEL2_AT1CP2S_MASK                    equ 0007h
AT1CSEL2_AT1CP2S0_POSN                   equ 0000h
AT1CSEL2_AT1CP2S0_POSITION               equ 0000h
AT1CSEL2_AT1CP2S0_SIZE                   equ 0001h
AT1CSEL2_AT1CP2S0_LENGTH                 equ 0001h
AT1CSEL2_AT1CP2S0_MASK                   equ 0001h
AT1CSEL2_AT1CP2S1_POSN                   equ 0001h
AT1CSEL2_AT1CP2S1_POSITION               equ 0001h
AT1CSEL2_AT1CP2S1_SIZE                   equ 0001h
AT1CSEL2_AT1CP2S1_LENGTH                 equ 0001h
AT1CSEL2_AT1CP2S1_MASK                   equ 0002h
AT1CSEL2_AT1CP2S2_POSN                   equ 0002h
AT1CSEL2_AT1CP2S2_POSITION               equ 0002h
AT1CSEL2_AT1CP2S2_SIZE                   equ 0001h
AT1CSEL2_AT1CP2S2_LENGTH                 equ 0001h
AT1CSEL2_AT1CP2S2_MASK                   equ 0004h
AT1CSEL2_CP2S_POSN                       equ 0000h
AT1CSEL2_CP2S_POSITION                   equ 0000h
AT1CSEL2_CP2S_SIZE                       equ 0003h
AT1CSEL2_CP2S_LENGTH                     equ 0003h
AT1CSEL2_CP2S_MASK                       equ 0007h
AT1CSEL2_CP2S0_POSN                      equ 0000h
AT1CSEL2_CP2S0_POSITION                  equ 0000h
AT1CSEL2_CP2S0_SIZE                      equ 0001h
AT1CSEL2_CP2S0_LENGTH                    equ 0001h
AT1CSEL2_CP2S0_MASK                      equ 0001h
AT1CSEL2_CP2S1_POSN                      equ 0001h
AT1CSEL2_CP2S1_POSITION                  equ 0001h
AT1CSEL2_CP2S1_SIZE                      equ 0001h
AT1CSEL2_CP2S1_LENGTH                    equ 0001h
AT1CSEL2_CP2S1_MASK                      equ 0002h
AT1CSEL2_CP2S2_POSN                      equ 0002h
AT1CSEL2_CP2S2_POSITION                  equ 0002h
AT1CSEL2_CP2S2_SIZE                      equ 0001h
AT1CSEL2_CP2S2_LENGTH                    equ 0001h
AT1CSEL2_CP2S2_MASK                      equ 0004h

// Register: AT1CC2L
#define AT1CC2L AT1CC2L
AT1CC2L                                  equ 0893h
// bitfield definitions
AT1CC2L_AT1CC20_POSN                     equ 0000h
AT1CC2L_AT1CC20_POSITION                 equ 0000h
AT1CC2L_AT1CC20_SIZE                     equ 0001h
AT1CC2L_AT1CC20_LENGTH                   equ 0001h
AT1CC2L_AT1CC20_MASK                     equ 0001h
AT1CC2L_AT1CC21_POSN                     equ 0001h
AT1CC2L_AT1CC21_POSITION                 equ 0001h
AT1CC2L_AT1CC21_SIZE                     equ 0001h
AT1CC2L_AT1CC21_LENGTH                   equ 0001h
AT1CC2L_AT1CC21_MASK                     equ 0002h
AT1CC2L_AT1CC22_POSN                     equ 0002h
AT1CC2L_AT1CC22_POSITION                 equ 0002h
AT1CC2L_AT1CC22_SIZE                     equ 0001h
AT1CC2L_AT1CC22_LENGTH                   equ 0001h
AT1CC2L_AT1CC22_MASK                     equ 0004h
AT1CC2L_AT1CC23_POSN                     equ 0003h
AT1CC2L_AT1CC23_POSITION                 equ 0003h
AT1CC2L_AT1CC23_SIZE                     equ 0001h
AT1CC2L_AT1CC23_LENGTH                   equ 0001h
AT1CC2L_AT1CC23_MASK                     equ 0008h
AT1CC2L_AT1CC24_POSN                     equ 0004h
AT1CC2L_AT1CC24_POSITION                 equ 0004h
AT1CC2L_AT1CC24_SIZE                     equ 0001h
AT1CC2L_AT1CC24_LENGTH                   equ 0001h
AT1CC2L_AT1CC24_MASK                     equ 0010h
AT1CC2L_AT1CC25_POSN                     equ 0005h
AT1CC2L_AT1CC25_POSITION                 equ 0005h
AT1CC2L_AT1CC25_SIZE                     equ 0001h
AT1CC2L_AT1CC25_LENGTH                   equ 0001h
AT1CC2L_AT1CC25_MASK                     equ 0020h
AT1CC2L_AT1CC26_POSN                     equ 0006h
AT1CC2L_AT1CC26_POSITION                 equ 0006h
AT1CC2L_AT1CC26_SIZE                     equ 0001h
AT1CC2L_AT1CC26_LENGTH                   equ 0001h
AT1CC2L_AT1CC26_MASK                     equ 0040h
AT1CC2L_AT1CC27_POSN                     equ 0007h
AT1CC2L_AT1CC27_POSITION                 equ 0007h
AT1CC2L_AT1CC27_SIZE                     equ 0001h
AT1CC2L_AT1CC27_LENGTH                   equ 0001h
AT1CC2L_AT1CC27_MASK                     equ 0080h
AT1CC2L_CC20_POSN                        equ 0000h
AT1CC2L_CC20_POSITION                    equ 0000h
AT1CC2L_CC20_SIZE                        equ 0001h
AT1CC2L_CC20_LENGTH                      equ 0001h
AT1CC2L_CC20_MASK                        equ 0001h
AT1CC2L_CC21_POSN                        equ 0001h
AT1CC2L_CC21_POSITION                    equ 0001h
AT1CC2L_CC21_SIZE                        equ 0001h
AT1CC2L_CC21_LENGTH                      equ 0001h
AT1CC2L_CC21_MASK                        equ 0002h
AT1CC2L_CC22_POSN                        equ 0002h
AT1CC2L_CC22_POSITION                    equ 0002h
AT1CC2L_CC22_SIZE                        equ 0001h
AT1CC2L_CC22_LENGTH                      equ 0001h
AT1CC2L_CC22_MASK                        equ 0004h
AT1CC2L_CC13_POSN                        equ 0003h
AT1CC2L_CC13_POSITION                    equ 0003h
AT1CC2L_CC13_SIZE                        equ 0001h
AT1CC2L_CC13_LENGTH                      equ 0001h
AT1CC2L_CC13_MASK                        equ 0008h
AT1CC2L_CC24_POSN                        equ 0004h
AT1CC2L_CC24_POSITION                    equ 0004h
AT1CC2L_CC24_SIZE                        equ 0001h
AT1CC2L_CC24_LENGTH                      equ 0001h
AT1CC2L_CC24_MASK                        equ 0010h
AT1CC2L_CCW5_POSN                        equ 0005h
AT1CC2L_CCW5_POSITION                    equ 0005h
AT1CC2L_CCW5_SIZE                        equ 0001h
AT1CC2L_CCW5_LENGTH                      equ 0001h
AT1CC2L_CCW5_MASK                        equ 0020h
AT1CC2L_CC26_POSN                        equ 0006h
AT1CC2L_CC26_POSITION                    equ 0006h
AT1CC2L_CC26_SIZE                        equ 0001h
AT1CC2L_CC26_LENGTH                      equ 0001h
AT1CC2L_CC26_MASK                        equ 0040h
AT1CC2L_CC27_POSN                        equ 0007h
AT1CC2L_CC27_POSITION                    equ 0007h
AT1CC2L_CC27_SIZE                        equ 0001h
AT1CC2L_CC27_LENGTH                      equ 0001h
AT1CC2L_CC27_MASK                        equ 0080h

// Register: AT1CC2H
#define AT1CC2H AT1CC2H
AT1CC2H                                  equ 0894h
// bitfield definitions
AT1CC2H_AT1CC28_POSN                     equ 0000h
AT1CC2H_AT1CC28_POSITION                 equ 0000h
AT1CC2H_AT1CC28_SIZE                     equ 0001h
AT1CC2H_AT1CC28_LENGTH                   equ 0001h
AT1CC2H_AT1CC28_MASK                     equ 0001h
AT1CC2H_AT1CC29_POSN                     equ 0001h
AT1CC2H_AT1CC29_POSITION                 equ 0001h
AT1CC2H_AT1CC29_SIZE                     equ 0001h
AT1CC2H_AT1CC29_LENGTH                   equ 0001h
AT1CC2H_AT1CC29_MASK                     equ 0002h
AT1CC2H_CC28_POSN                        equ 0000h
AT1CC2H_CC28_POSITION                    equ 0000h
AT1CC2H_CC28_SIZE                        equ 0001h
AT1CC2H_CC28_LENGTH                      equ 0001h
AT1CC2H_CC28_MASK                        equ 0001h
AT1CC2H_CC29_POSN                        equ 0001h
AT1CC2H_CC29_POSITION                    equ 0001h
AT1CC2H_CC29_SIZE                        equ 0001h
AT1CC2H_CC29_LENGTH                      equ 0001h
AT1CC2H_CC29_MASK                        equ 0002h

// Register: AT1CCON2
#define AT1CCON2 AT1CCON2
AT1CCON2                                 equ 0895h
// bitfield definitions
AT1CCON2_AT1CC2MODE_POSN                 equ 0000h
AT1CCON2_AT1CC2MODE_POSITION             equ 0000h
AT1CCON2_AT1CC2MODE_SIZE                 equ 0001h
AT1CCON2_AT1CC2MODE_LENGTH               equ 0001h
AT1CCON2_AT1CC2MODE_MASK                 equ 0001h
AT1CCON2_AT1CAP2P_POSN                   equ 0003h
AT1CCON2_AT1CAP2P_POSITION               equ 0003h
AT1CCON2_AT1CAP2P_SIZE                   equ 0001h
AT1CCON2_AT1CAP2P_LENGTH                 equ 0001h
AT1CCON2_AT1CAP2P_MASK                   equ 0008h
AT1CCON2_AT1CC2POL_POSN                  equ 0004h
AT1CCON2_AT1CC2POL_POSITION              equ 0004h
AT1CCON2_AT1CC2POL_SIZE                  equ 0001h
AT1CCON2_AT1CC2POL_LENGTH                equ 0001h
AT1CCON2_AT1CC2POL_MASK                  equ 0010h
AT1CCON2_AT1CC2EN_POSN                   equ 0007h
AT1CCON2_AT1CC2EN_POSITION               equ 0007h
AT1CCON2_AT1CC2EN_SIZE                   equ 0001h
AT1CCON2_AT1CC2EN_LENGTH                 equ 0001h
AT1CCON2_AT1CC2EN_MASK                   equ 0080h
AT1CCON2_CC2MODE_POSN                    equ 0000h
AT1CCON2_CC2MODE_POSITION                equ 0000h
AT1CCON2_CC2MODE_SIZE                    equ 0001h
AT1CCON2_CC2MODE_LENGTH                  equ 0001h
AT1CCON2_CC2MODE_MASK                    equ 0001h
AT1CCON2_CAP2P_POSN                      equ 0003h
AT1CCON2_CAP2P_POSITION                  equ 0003h
AT1CCON2_CAP2P_SIZE                      equ 0001h
AT1CCON2_CAP2P_LENGTH                    equ 0001h
AT1CCON2_CAP2P_MASK                      equ 0008h
AT1CCON2_CC2POL_POSN                     equ 0004h
AT1CCON2_CC2POL_POSITION                 equ 0004h
AT1CCON2_CC2POL_SIZE                     equ 0001h
AT1CCON2_CC2POL_LENGTH                   equ 0001h
AT1CCON2_CC2POL_MASK                     equ 0010h
AT1CCON2_CC2EN_POSN                      equ 0007h
AT1CCON2_CC2EN_POSITION                  equ 0007h
AT1CCON2_CC2EN_SIZE                      equ 0001h
AT1CCON2_CC2EN_LENGTH                    equ 0001h
AT1CCON2_CC2EN_MASK                      equ 0080h

// Register: AT1CSEL3
#define AT1CSEL3 AT1CSEL3
AT1CSEL3                                 equ 0896h
// bitfield definitions
AT1CSEL3_AT1CP3S_POSN                    equ 0000h
AT1CSEL3_AT1CP3S_POSITION                equ 0000h
AT1CSEL3_AT1CP3S_SIZE                    equ 0003h
AT1CSEL3_AT1CP3S_LENGTH                  equ 0003h
AT1CSEL3_AT1CP3S_MASK                    equ 0007h
AT1CSEL3_AT1CP3S0_POSN                   equ 0000h
AT1CSEL3_AT1CP3S0_POSITION               equ 0000h
AT1CSEL3_AT1CP3S0_SIZE                   equ 0001h
AT1CSEL3_AT1CP3S0_LENGTH                 equ 0001h
AT1CSEL3_AT1CP3S0_MASK                   equ 0001h
AT1CSEL3_AT1CP3S1_POSN                   equ 0001h
AT1CSEL3_AT1CP3S1_POSITION               equ 0001h
AT1CSEL3_AT1CP3S1_SIZE                   equ 0001h
AT1CSEL3_AT1CP3S1_LENGTH                 equ 0001h
AT1CSEL3_AT1CP3S1_MASK                   equ 0002h
AT1CSEL3_AT1CP3S2_POSN                   equ 0002h
AT1CSEL3_AT1CP3S2_POSITION               equ 0002h
AT1CSEL3_AT1CP3S2_SIZE                   equ 0001h
AT1CSEL3_AT1CP3S2_LENGTH                 equ 0001h
AT1CSEL3_AT1CP3S2_MASK                   equ 0004h
AT1CSEL3_CP3S_POSN                       equ 0000h
AT1CSEL3_CP3S_POSITION                   equ 0000h
AT1CSEL3_CP3S_SIZE                       equ 0003h
AT1CSEL3_CP3S_LENGTH                     equ 0003h
AT1CSEL3_CP3S_MASK                       equ 0007h
AT1CSEL3_CP3S0_POSN                      equ 0000h
AT1CSEL3_CP3S0_POSITION                  equ 0000h
AT1CSEL3_CP3S0_SIZE                      equ 0001h
AT1CSEL3_CP3S0_LENGTH                    equ 0001h
AT1CSEL3_CP3S0_MASK                      equ 0001h
AT1CSEL3_CP3S1_POSN                      equ 0001h
AT1CSEL3_CP3S1_POSITION                  equ 0001h
AT1CSEL3_CP3S1_SIZE                      equ 0001h
AT1CSEL3_CP3S1_LENGTH                    equ 0001h
AT1CSEL3_CP3S1_MASK                      equ 0002h
AT1CSEL3_CP3S2_POSN                      equ 0002h
AT1CSEL3_CP3S2_POSITION                  equ 0002h
AT1CSEL3_CP3S2_SIZE                      equ 0001h
AT1CSEL3_CP3S2_LENGTH                    equ 0001h
AT1CSEL3_CP3S2_MASK                      equ 0004h

// Register: AT1CC3L
#define AT1CC3L AT1CC3L
AT1CC3L                                  equ 0897h
// bitfield definitions
AT1CC3L_AT1CC30_POSN                     equ 0000h
AT1CC3L_AT1CC30_POSITION                 equ 0000h
AT1CC3L_AT1CC30_SIZE                     equ 0001h
AT1CC3L_AT1CC30_LENGTH                   equ 0001h
AT1CC3L_AT1CC30_MASK                     equ 0001h
AT1CC3L_AT1CC31_POSN                     equ 0001h
AT1CC3L_AT1CC31_POSITION                 equ 0001h
AT1CC3L_AT1CC31_SIZE                     equ 0001h
AT1CC3L_AT1CC31_LENGTH                   equ 0001h
AT1CC3L_AT1CC31_MASK                     equ 0002h
AT1CC3L_AT1CC32_POSN                     equ 0002h
AT1CC3L_AT1CC32_POSITION                 equ 0002h
AT1CC3L_AT1CC32_SIZE                     equ 0001h
AT1CC3L_AT1CC32_LENGTH                   equ 0001h
AT1CC3L_AT1CC32_MASK                     equ 0004h
AT1CC3L_AT1CC33_POSN                     equ 0003h
AT1CC3L_AT1CC33_POSITION                 equ 0003h
AT1CC3L_AT1CC33_SIZE                     equ 0001h
AT1CC3L_AT1CC33_LENGTH                   equ 0001h
AT1CC3L_AT1CC33_MASK                     equ 0008h
AT1CC3L_AT1CC34_POSN                     equ 0004h
AT1CC3L_AT1CC34_POSITION                 equ 0004h
AT1CC3L_AT1CC34_SIZE                     equ 0001h
AT1CC3L_AT1CC34_LENGTH                   equ 0001h
AT1CC3L_AT1CC34_MASK                     equ 0010h
AT1CC3L_AT1CC35_POSN                     equ 0005h
AT1CC3L_AT1CC35_POSITION                 equ 0005h
AT1CC3L_AT1CC35_SIZE                     equ 0001h
AT1CC3L_AT1CC35_LENGTH                   equ 0001h
AT1CC3L_AT1CC35_MASK                     equ 0020h
AT1CC3L_AT1CC36_POSN                     equ 0006h
AT1CC3L_AT1CC36_POSITION                 equ 0006h
AT1CC3L_AT1CC36_SIZE                     equ 0001h
AT1CC3L_AT1CC36_LENGTH                   equ 0001h
AT1CC3L_AT1CC36_MASK                     equ 0040h
AT1CC3L_AT1CC37_POSN                     equ 0007h
AT1CC3L_AT1CC37_POSITION                 equ 0007h
AT1CC3L_AT1CC37_SIZE                     equ 0001h
AT1CC3L_AT1CC37_LENGTH                   equ 0001h
AT1CC3L_AT1CC37_MASK                     equ 0080h
AT1CC3L_CC30_POSN                        equ 0000h
AT1CC3L_CC30_POSITION                    equ 0000h
AT1CC3L_CC30_SIZE                        equ 0001h
AT1CC3L_CC30_LENGTH                      equ 0001h
AT1CC3L_CC30_MASK                        equ 0001h
AT1CC3L_CC31_POSN                        equ 0001h
AT1CC3L_CC31_POSITION                    equ 0001h
AT1CC3L_CC31_SIZE                        equ 0001h
AT1CC3L_CC31_LENGTH                      equ 0001h
AT1CC3L_CC31_MASK                        equ 0002h
AT1CC3L_CC32_POSN                        equ 0002h
AT1CC3L_CC32_POSITION                    equ 0002h
AT1CC3L_CC32_SIZE                        equ 0001h
AT1CC3L_CC32_LENGTH                      equ 0001h
AT1CC3L_CC32_MASK                        equ 0004h
AT1CC3L_CC33_POSN                        equ 0003h
AT1CC3L_CC33_POSITION                    equ 0003h
AT1CC3L_CC33_SIZE                        equ 0001h
AT1CC3L_CC33_LENGTH                      equ 0001h
AT1CC3L_CC33_MASK                        equ 0008h
AT1CC3L_CC34_POSN                        equ 0004h
AT1CC3L_CC34_POSITION                    equ 0004h
AT1CC3L_CC34_SIZE                        equ 0001h
AT1CC3L_CC34_LENGTH                      equ 0001h
AT1CC3L_CC34_MASK                        equ 0010h
AT1CC3L_CC35_POSN                        equ 0005h
AT1CC3L_CC35_POSITION                    equ 0005h
AT1CC3L_CC35_SIZE                        equ 0001h
AT1CC3L_CC35_LENGTH                      equ 0001h
AT1CC3L_CC35_MASK                        equ 0020h
AT1CC3L_CC36_POSN                        equ 0006h
AT1CC3L_CC36_POSITION                    equ 0006h
AT1CC3L_CC36_SIZE                        equ 0001h
AT1CC3L_CC36_LENGTH                      equ 0001h
AT1CC3L_CC36_MASK                        equ 0040h
AT1CC3L_CC37_POSN                        equ 0007h
AT1CC3L_CC37_POSITION                    equ 0007h
AT1CC3L_CC37_SIZE                        equ 0001h
AT1CC3L_CC37_LENGTH                      equ 0001h
AT1CC3L_CC37_MASK                        equ 0080h

