GopalSaraf/Practicals/PSDL/include/proc/pic16f1619.inc
#define LD                               BANKMASK(CWG1CON0), 6
#define LDAR0                            BANKMASK(SCANLADRL), 0
#define LDAR1                            BANKMASK(SCANLADRL), 1
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LSAC0                            BANKMASK(CWG1AS0), 2
#define LSAC1                            BANKMASK(CWG1AS0), 3
#define LSBD0                            BANKMASK(CWG1AS0), 4
#define LSBD1                            BANKMASK(CWG1AS0), 5
#define LWLO                             BANKMASK(PMCON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define MISS0                            BANKMASK(AT1MISSL), 0
#define MISS1                            BANKMASK(AT1MISSL), 1
#define MISS10                           BANKMASK(AT1MISSH), 2
#define MISS11                           BANKMASK(AT1MISSH), 3
#define MISS12                           BANKMASK(AT1MISSH), 4
#define MISS13                           BANKMASK(AT1MISSH), 5
#define MISS14                           BANKMASK(AT1MISSH), 6
#define MISS15                           BANKMASK(AT1MISSH), 7
#define MISS2                            BANKMASK(AT1MISSL), 2
#define MISS3                            BANKMASK(AT1MISSL), 3
#define MISS4                            BANKMASK(AT1MISSL), 4
#define MISS5                            BANKMASK(AT1MISSL), 5
#define MISS6                            BANKMASK(AT1MISSL), 6
#define MISS7                            BANKMASK(AT1MISSL), 7
#define MISS8                            BANKMASK(AT1MISSH), 0
#define MISS9                            BANKMASK(AT1MISSH), 1
#define MLC1OUT                          BANKMASK(CLCDATA), 0
#define MLC2OUT                          BANKMASK(CLCDATA), 1
#define MLC3OUT                          BANKMASK(CLCDATA), 2
#define MLC4OUT                          BANKMASK(CLCDATA), 3
#define MODE                             BANKMASK(AT1CON0), 0
#define MPP                              BANKMASK(AT1CON1), 2
#define MSK0                             BANKMASK(SSP1MSK), 0
#define MSK1                             BANKMASK(SSP1MSK), 1
#define MSK2                             BANKMASK(SSP1MSK), 2
#define MSK3                             BANKMASK(SSP1MSK), 3
#define MSK4                             BANKMASK(SSP1MSK), 4
#define MSK5                             BANKMASK(SSP1MSK), 5
#define MSK6                             BANKMASK(SSP1MSK), 6
#define MSK7                             BANKMASK(SSP1MSK), 7
#define ODA0                             BANKMASK(ODCONA), 0
#define ODA1                             BANKMASK(ODCONA), 1
#define ODA2                             BANKMASK(ODCONA), 2
#define ODA4                             BANKMASK(ODCONA), 4
#define ODA5                             BANKMASK(ODCONA), 5
#define ODB4                             BANKMASK(ODCONB), 4
#define ODB5                             BANKMASK(ODCONB), 5
#define ODB6                             BANKMASK(ODCONB), 6
#define ODB7                             BANKMASK(ODCONB), 7
#define ODC0                             BANKMASK(ODCONC), 0
#define ODC1                             BANKMASK(ODCONC), 1
#define ODC2                             BANKMASK(ODCONC), 2
#define ODC3                             BANKMASK(ODCONC), 3
#define ODC4                             BANKMASK(ODCONC), 4
#define ODC5                             BANKMASK(ODCONC), 5
#define ODC6                             BANKMASK(ODCONC), 6
#define ODC7                             BANKMASK(ODCONC), 7
#define OERR                             BANKMASK(RC1STA), 1
#define OSCFIE                           BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCSTAT), 5
#define OUT0                             BANKMASK(PID1OUTLL), 0
#define OUT1                             BANKMASK(PID1OUTLL), 1
#define OUT10                            BANKMASK(PID1OUTLH), 2
#define OUT11                            BANKMASK(PID1OUTLH), 3
#define OUT12                            BANKMASK(PID1OUTLH), 4
#define OUT13                            BANKMASK(PID1OUTLH), 5
#define OUT14                            BANKMASK(PID1OUTLH), 6
#define OUT15                            BANKMASK(PID1OUTLH), 7
#define OUT16                            BANKMASK(PID1OUTHL), 0
#define OUT17                            BANKMASK(PID1OUTHL), 1
#define OUT18                            BANKMASK(PID1OUTHL), 2
#define OUT19                            BANKMASK(PID1OUTHL), 3
#define OUT2                             BANKMASK(PID1OUTLL), 2
#define OUT20                            BANKMASK(PID1OUTHL), 4
#define OUT21                            BANKMASK(PID1OUTHL), 5
#define OUT22                            BANKMASK(PID1OUTHL), 6
#define OUT23                            BANKMASK(PID1OUTHL), 7
#define OUT24                            BANKMASK(PID1OUTHH), 0
#define OUT25                            BANKMASK(PID1OUTHH), 1
#define OUT26                            BANKMASK(PID1OUTHH), 2
#define OUT27                            BANKMASK(PID1OUTHH), 3
#define OUT28                            BANKMASK(PID1OUTHH), 4
#define OUT29                            BANKMASK(PID1OUTHH), 5
#define OUT3                             BANKMASK(PID1OUTLL), 3
#define OUT30                            BANKMASK(PID1OUTHH), 6
#define OUT31                            BANKMASK(PID1OUTHH), 7
#define OUT32                            BANKMASK(PID1OUTU), 0
#define OUT33                            BANKMASK(PID1OUTU), 1
#define OUT34                            BANKMASK(PID1OUTU), 2
#define OUT35                            BANKMASK(PID1OUTU), 3
#define OUT4                             BANKMASK(PID1OUTLL), 4
#define OUT5                             BANKMASK(PID1OUTLL), 5
#define OUT6                             BANKMASK(PID1OUTLL), 6
#define OUT7                             BANKMASK(PID1OUTLL), 7
#define OUT8                             BANKMASK(PID1OUTLH), 0
#define OUT9                             BANKMASK(PID1OUTLH), 1
#define OVRA                             BANKMASK(CWG1OCON0), 4
#define OVRB                             BANKMASK(CWG1OCON0), 5
#define OVRC                             BANKMASK(CWG1OCON0), 6
#define OVRD                             BANKMASK(CWG1OCON0), 7
#define P3TSEL0                          BANKMASK(CCPTMRS), 4
#define P3TSEL1                          BANKMASK(CCPTMRS), 5
#define P4TSEL0                          BANKMASK(CCPTMRS), 6
#define P4TSEL1                          BANKMASK(CCPTMRS), 7
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PER0                             BANKMASK(AT1PERL), 0
#define PER1                             BANKMASK(AT1PERL), 1
#define PER10                            BANKMASK(AT1PERH), 2
#define PER11                            BANKMASK(AT1PERH), 3
#define PER12                            BANKMASK(AT1PERH), 4
#define PER13                            BANKMASK(AT1PERH), 5
#define PER14                            BANKMASK(AT1PERH), 6
#define PER15                            BANKMASK(AT1PERH), 7
#define PER2                             BANKMASK(AT1PERL), 2
#define PER3                             BANKMASK(AT1PERL), 3
#define PER4                             BANKMASK(AT1PERL), 4
#define PER5                             BANKMASK(AT1PERL), 5
#define PER6                             BANKMASK(AT1PERL), 6
#define PER7                             BANKMASK(AT1PERL), 7
#define PER8                             BANKMASK(AT1PERH), 0
#define PER9                             BANKMASK(AT1PERH), 1
#define PERH0                            BANKMASK(AT1PERH), 0
#define PERH1                            BANKMASK(AT1PERH), 1
#define PERH2                            BANKMASK(AT1PERH), 2
#define PERH3                            BANKMASK(AT1PERH), 3
#define PERH4                            BANKMASK(AT1PERH), 4
#define PERH5                            BANKMASK(AT1PERH), 5
#define PERH6                            BANKMASK(AT1PERH), 6
#define PERH7                            BANKMASK(AT1PERH), 7
#define PERL0                            BANKMASK(AT1PERL), 0
#define PERL1                            BANKMASK(AT1PERL), 1
#define PERL2                            BANKMASK(AT1PERL), 2
#define PERL3                            BANKMASK(AT1PERL), 3
#define PERL4                            BANKMASK(AT1PERL), 4
#define PERL5                            BANKMASK(AT1PERL), 5
#define PERL6                            BANKMASK(AT1PERL), 6
#define PERL7                            BANKMASK(AT1PERL), 7
#define PHP                              BANKMASK(AT1CON1), 6
#define PHS0                             BANKMASK(AT1PHSL), 0
#define PHS1                             BANKMASK(AT1PHSL), 1
#define PHS2                             BANKMASK(AT1PHSL), 2
#define PHS3                             BANKMASK(AT1PHSL), 3
#define PHS4                             BANKMASK(AT1PHSL), 4
#define PHS5                             BANKMASK(AT1PHSL), 5
#define PHS6                             BANKMASK(AT1PHSL), 6
#define PHS7                             BANKMASK(AT1PHSL), 7
#define PHS8                             BANKMASK(AT1PHSH), 0
#define PHS9                             BANKMASK(AT1PHSH), 1
#define PHSL8                            BANKMASK(AT1PHSH), 0
#define PHSL9                            BANKMASK(AT1PHSH), 1
#define PID1ACC0                         BANKMASK(PID1ACCLL), 0
#define PID1ACC1                         BANKMASK(PID1ACCLL), 1
#define PID1ACC10                        BANKMASK(PID1ACCLH), 2
#define PID1ACC11                        BANKMASK(PID1ACCLH), 3
#define PID1ACC12                        BANKMASK(PID1ACCLH), 4
#define PID1ACC13                        BANKMASK(PID1ACCLH), 5
#define PID1ACC14                        BANKMASK(PID1ACCLH), 6
#define PID1ACC15                        BANKMASK(PID1ACCLH), 7
#define PID1ACC16                        BANKMASK(PID1ACCHL), 0
#define PID1ACC17                        BANKMASK(PID1ACCHL), 1
#define PID1ACC18                        BANKMASK(PID1ACCHL), 2
#define PID1ACC19                        BANKMASK(PID1ACCHL), 3
#define PID1ACC2                         BANKMASK(PID1ACCLL), 2
#define PID1ACC20                        BANKMASK(PID1ACCHL), 4
#define PID1ACC21                        BANKMASK(PID1ACCHL), 5
#define PID1ACC22                        BANKMASK(PID1ACCHL), 6
#define PID1ACC23                        BANKMASK(PID1ACCHL), 7
#define PID1ACC24                        BANKMASK(PID1ACCHH), 0
#define PID1ACC25                        BANKMASK(PID1ACCHH), 1
#define PID1ACC26                        BANKMASK(PID1ACCHH), 2
#define PID1ACC27                        BANKMASK(PID1ACCHH), 3
#define PID1ACC28                        BANKMASK(PID1ACCHH), 4
#define PID1ACC29                        BANKMASK(PID1ACCHH), 5
#define PID1ACC3                         BANKMASK(PID1ACCLL), 3
#define PID1ACC30                        BANKMASK(PID1ACCHH), 6
#define PID1ACC31                        BANKMASK(PID1ACCHH), 7
#define PID1ACC32                        BANKMASK(PID1ACCU), 0
#define PID1ACC33                        BANKMASK(PID1ACCU), 1
#define PID1ACC34                        BANKMASK(PID1ACCU), 2
#define PID1ACC4                         BANKMASK(PID1ACCLL), 4
#define PID1ACC5                         BANKMASK(PID1ACCLL), 5
#define PID1ACC6                         BANKMASK(PID1ACCLL), 6
#define PID1ACC7                         BANKMASK(PID1ACCLL), 7
#define PID1ACC8                         BANKMASK(PID1ACCLH), 0
#define PID1ACC9                         BANKMASK(PID1ACCLH), 1
#define PID1BUSY                         BANKMASK(PID1CON), 6
#define PID1DIE                          BANKMASK(PIE5), 0
#define PID1DIF                          BANKMASK(PIR5), 0
#define PID1EIE                          BANKMASK(PIE5), 1
#define PID1EIF                          BANKMASK(PIR5), 1
#define PID1EN                           BANKMASK(PID1CON), 7
#define PID1IN0                          BANKMASK(PID1INL), 0
#define PID1IN1                          BANKMASK(PID1INL), 1
#define PID1IN10                         BANKMASK(PID1INH), 2
#define PID1IN11                         BANKMASK(PID1INH), 3
#define PID1IN12                         BANKMASK(PID1INH), 4
#define PID1IN13                         BANKMASK(PID1INH), 5
#define PID1IN14                         BANKMASK(PID1INH), 6
#define PID1IN15                         BANKMASK(PID1INH), 7
#define PID1IN2                          BANKMASK(PID1INL), 2
#define PID1IN3                          BANKMASK(PID1INL), 3
#define PID1IN4                          BANKMASK(PID1INL), 4
#define PID1IN5                          BANKMASK(PID1INL), 5
#define PID1IN6                          BANKMASK(PID1INL), 6
#define PID1IN7                          BANKMASK(PID1INL), 7
#define PID1IN8                          BANKMASK(PID1INH), 0
#define PID1IN9                          BANKMASK(PID1INH), 1
#define PID1K10                          BANKMASK(PID1K1L), 0
#define PID1K11                          BANKMASK(PID1K1L), 1
#define PID1K110                         BANKMASK(PID1K1H), 2
#define PID1K111                         BANKMASK(PID1K1H), 3
#define PID1K112                         BANKMASK(PID1K1H), 4
#define PID1K113                         BANKMASK(PID1K1H), 5
#define PID1K114                         BANKMASK(PID1K1H), 6
#define PID1K115                         BANKMASK(PID1K1H), 7
#define PID1K12                          BANKMASK(PID1K1L), 2
#define PID1K13                          BANKMASK(PID1K1L), 3
#define PID1K14                          BANKMASK(PID1K1L), 4
#define PID1K15                          BANKMASK(PID1K1L), 5
#define PID1K16                          BANKMASK(PID1K1L), 6
#define PID1K17                          BANKMASK(PID1K1L), 7
#define PID1K18                          BANKMASK(PID1K1H), 0
#define PID1K19                          BANKMASK(PID1K1H), 1
#define PID1K20                          BANKMASK(PID1K2L), 0
#define PID1K21                          BANKMASK(PID1K2L), 1
#define PID1K210                         BANKMASK(PID1K2H), 2
#define PID1K211                         BANKMASK(PID1K2H), 3
#define PID1K212                         BANKMASK(PID1K2H), 4
#define PID1K213                         BANKMASK(PID1K2H), 5
#define PID1K214                         BANKMASK(PID1K2H), 6
#define PID1K215                         BANKMASK(PID1K2H), 7
#define PID1K22                          BANKMASK(PID1K2L), 2
#define PID1K23                          BANKMASK(PID1K2L), 3
#define PID1K24                          BANKMASK(PID1K2L), 4
#define PID1K25                          BANKMASK(PID1K2L), 5
#define PID1K26                          BANKMASK(PID1K2L), 6
#define PID1K27                          BANKMASK(PID1K2L), 7
#define PID1K28                          BANKMASK(PID1K2H), 0
#define PID1K29                          BANKMASK(PID1K2H), 1
#define PID1K30                          BANKMASK(PID1K3L), 0
#define PID1K31                          BANKMASK(PID1K3L), 1
#define PID1K310                         BANKMASK(PID1K3H), 2
#define PID1K311                         BANKMASK(PID1K3H), 3
#define PID1K312                         BANKMASK(PID1K3H), 4
#define PID1K313                         BANKMASK(PID1K3H), 5
#define PID1K314                         BANKMASK(PID1K3H), 6
#define PID1K315                         BANKMASK(PID1K3H), 7
#define PID1K32                          BANKMASK(PID1K3L), 2
#define PID1K33                          BANKMASK(PID1K3L), 3
#define PID1K34                          BANKMASK(PID1K3L), 4
#define PID1K35                          BANKMASK(PID1K3L), 5
#define PID1K36                          BANKMASK(PID1K3L), 6
#define PID1K37                          BANKMASK(PID1K3L), 7
#define PID1K38                          BANKMASK(PID1K3H), 0
#define PID1K39                          BANKMASK(PID1K3H), 1
#define PID1MODE0                        BANKMASK(PID1CON), 0
#define PID1MODE1                        BANKMASK(PID1CON), 1
#define PID1MODE2                        BANKMASK(PID1CON), 2
#define PID1OUT0                         BANKMASK(PID1OUTLL), 0
#define PID1OUT1                         BANKMASK(PID1OUTLL), 1
#define PID1OUT10                        BANKMASK(PID1OUTLH), 2
#define PID1OUT11                        BANKMASK(PID1OUTLH), 3
#define PID1OUT12                        BANKMASK(PID1OUTLH), 4
#define PID1OUT13                        BANKMASK(PID1OUTLH), 5
#define PID1OUT14                        BANKMASK(PID1OUTLH), 6
#define PID1OUT15                        BANKMASK(PID1OUTLH), 7
#define PID1OUT16                        BANKMASK(PID1OUTHL), 0
#define PID1OUT17                        BANKMASK(PID1OUTHL), 1
#define PID1OUT18                        BANKMASK(PID1OUTHL), 2
#define PID1OUT19                        BANKMASK(PID1OUTHL), 3
#define PID1OUT2                         BANKMASK(PID1OUTLL), 2
#define PID1OUT20                        BANKMASK(PID1OUTHL), 4
#define PID1OUT21                        BANKMASK(PID1OUTHL), 5
#define PID1OUT22                        BANKMASK(PID1OUTHL), 6
#define PID1OUT23                        BANKMASK(PID1OUTHL), 7
#define PID1OUT24                        BANKMASK(PID1OUTHH), 0
#define PID1OUT25                        BANKMASK(PID1OUTHH), 1
#define PID1OUT26                        BANKMASK(PID1OUTHH), 2
#define PID1OUT27                        BANKMASK(PID1OUTHH), 3
#define PID1OUT28                        BANKMASK(PID1OUTHH), 4
#define PID1OUT29                        BANKMASK(PID1OUTHH), 5
#define PID1OUT3                         BANKMASK(PID1OUTLL), 3
#define PID1OUT30                        BANKMASK(PID1OUTHH), 6
#define PID1OUT31                        BANKMASK(PID1OUTHH), 7
#define PID1OUT32                        BANKMASK(PID1OUTU), 0
#define PID1OUT33                        BANKMASK(PID1OUTU), 1
#define PID1OUT34                        BANKMASK(PID1OUTU), 2
#define PID1OUT35                        BANKMASK(PID1OUTU), 3
#define PID1OUT4                         BANKMASK(PID1OUTLL), 4
#define PID1OUT5                         BANKMASK(PID1OUTLL), 5
#define PID1OUT6                         BANKMASK(PID1OUTLL), 6
#define PID1OUT7                         BANKMASK(PID1OUTLL), 7
#define PID1OUT8                         BANKMASK(PID1OUTLH), 0
#define PID1OUT9                         BANKMASK(PID1OUTLH), 1
#define PID1SET0                         BANKMASK(PID1SETL), 0
#define PID1SET1                         BANKMASK(PID1SETL), 1
#define PID1SET10                        BANKMASK(PID1SETH), 2
#define PID1SET11                        BANKMASK(PID1SETH), 3
#define PID1SET12                        BANKMASK(PID1SETH), 4
#define PID1SET13                        BANKMASK(PID1SETH), 5
#define PID1SET14                        BANKMASK(PID1SETH), 6
#define PID1SET15                        BANKMASK(PID1SETH), 7
#define PID1SET2                         BANKMASK(PID1SETL), 2
#define PID1SET3                         BANKMASK(PID1SETL), 3
#define PID1SET4                         BANKMASK(PID1SETL), 4
#define PID1SET5                         BANKMASK(PID1SETL), 5
#define PID1SET6                         BANKMASK(PID1SETL), 6
#define PID1SET7                         BANKMASK(PID1SETL), 7
#define PID1SET8                         BANKMASK(PID1SETH), 0
#define PID1SET9                         BANKMASK(PID1SETH), 1
#define PID1Z10                          BANKMASK(PID1Z1L), 0
#define PID1Z11                          BANKMASK(PID1Z1L), 1
#define PID1Z110                         BANKMASK(PID1Z1H), 2
#define PID1Z111                         BANKMASK(PID1Z1H), 3
#define PID1Z112                         BANKMASK(PID1Z1H), 4
#define PID1Z113                         BANKMASK(PID1Z1H), 5
#define PID1Z114                         BANKMASK(PID1Z1H), 6
#define PID1Z115                         BANKMASK(PID1Z1H), 7
#define PID1Z116                         BANKMASK(PID1Z1U), 0
#define PID1Z12                          BANKMASK(PID1Z1L), 2
#define PID1Z13                          BANKMASK(PID1Z1L), 3
#define PID1Z14                          BANKMASK(PID1Z1L), 4
#define PID1Z15                          BANKMASK(PID1Z1L), 5
#define PID1Z16                          BANKMASK(PID1Z1L), 6
#define PID1Z17                          BANKMASK(PID1Z1L), 7
#define PID1Z18                          BANKMASK(PID1Z1H), 0
#define PID1Z19                          BANKMASK(PID1Z1H), 1
#define PID1Z20                          BANKMASK(PID1Z2L), 0
#define PID1Z21                          BANKMASK(PID1Z2L), 1
#define PID1Z210                         BANKMASK(PID1Z2H), 2
#define PID1Z211                         BANKMASK(PID1Z2H), 3
#define PID1Z212                         BANKMASK(PID1Z2H), 4
#define PID1Z213                         BANKMASK(PID1Z2H), 5
#define PID1Z214                         BANKMASK(PID1Z2H), 6
#define PID1Z215                         BANKMASK(PID1Z2H), 7
#define PID1Z216                         BANKMASK(PID1Z2U), 0
#define PID1Z22                          BANKMASK(PID1Z2L), 2
#define PID1Z23                          BANKMASK(PID1Z2L), 3
#define PID1Z24                          BANKMASK(PID1Z2L), 4
#define PID1Z25                          BANKMASK(PID1Z2L), 5
#define PID1Z26                          BANKMASK(PID1Z2L), 6
#define PID1Z27                          BANKMASK(PID1Z2L), 7
#define PID1Z28                          BANKMASK(PID1Z2H), 0
#define PID1Z29                          BANKMASK(PID1Z2H), 1
#define PLEN0                            BANKMASK(CRCCON1), 0
#define PLEN1                            BANKMASK(CRCCON1), 1
#define PLEN2                            BANKMASK(CRCCON1), 2
#define PLEN3                            BANKMASK(CRCCON1), 3
#define PLLR                             BANKMASK(OSCSTAT), 6
#define POLA                             BANKMASK(CWG1CON1), 0
#define POLB                             BANKMASK(CWG1CON1), 1
#define POLC                             BANKMASK(CWG1CON1), 2
#define POLD                             BANKMASK(CWG1CON1), 3
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PREC                             BANKMASK(AT1CON0), 6
#define PRP                              BANKMASK(AT1CON1), 4
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSCNT0                           BANKMASK(WDTPSL), 0
#define PSCNT1                           BANKMASK(WDTPSL), 1
#define PSCNT10                          BANKMASK(WDTPSH), 2
#define PSCNT11                          BANKMASK(WDTPSH), 3
#define PSCNT12                          BANKMASK(WDTPSH), 4
#define PSCNT13                          BANKMASK(WDTPSH), 5
#define PSCNT14                          BANKMASK(WDTPSH), 6
#define PSCNT15                          BANKMASK(WDTPSH), 7
#define PSCNT16                          BANKMASK(WDTTMR), 0
#define PSCNT17                          BANKMASK(WDTTMR), 1
#define PSCNT2                           BANKMASK(WDTPSL), 2
#define PSCNT3                           BANKMASK(WDTPSL), 3
#define PSCNT4                           BANKMASK(WDTPSL), 4
#define PSCNT5                           BANKMASK(WDTPSL), 5
#define PSCNT6                           BANKMASK(WDTPSL), 6
#define PSCNT7                           BANKMASK(WDTPSL), 7
#define PSCNT8                           BANKMASK(WDTPSH), 0
#define PSCNT9                           BANKMASK(WDTPSH), 1
#define PWM3DC0                          BANKMASK(PWM3DCL), 6
#define PWM3DC1                          BANKMASK(PWM3DCL), 7
